## Plan Result (sbox_shutter_webapp - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 15 to add, 4 to change, 5 to destroy.</code></pre>

* Create
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;labs-ashleigh31-nodejs&#34;]
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;labs-jamiemcconnell-nodejs&#34;]
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;labs-lukaszk-hmcts-nodejs&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;labs-ashleigh31-nodejs&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;labs-jamiemcconnell-nodejs&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;labs-lukaszk-hmcts-nodejs&#34;]
  * module.static_webapp.azurerm_static_site.swebapp[&#34;labs-ashleigh31-nodejs&#34;]
  * module.static_webapp.azurerm_static_site.swebapp[&#34;labs-jamiemcconnell-nodejs&#34;]
  * module.static_webapp.azurerm_static_site.swebapp[&#34;labs-lukaszk-hmcts-nodejs&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;labs-ashleigh31-nodejs&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;labs-jamiemcconnell-nodejs&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;labs-lukaszk-hmcts-nodejs&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;labs-ashleigh31-nodejs&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;labs-jamiemcconnell-nodejs&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;labs-lukaszk-hmcts-nodejs&#34;]
* Update
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;labs-dawidstrozak-nodejs&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;labs-goldenpath-ashleigh&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;labs-goldenpath-dawid&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;labs-goldenpath-jamie&#34;]
* Delete
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;labs-goldenpath-lukasz&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;labs-goldenpath-lukasz&#34;]
  * module.static_webapp.azurerm_static_site.swebapp[&#34;labs-goldenpath-lukasz&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;labs-goldenpath-lukasz&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;labs-goldenpath-lukasz&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.static_webapp.azurerm_dns_cname_record.cname_record["labs-ashleigh31-nodejs"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "labs-ashleigh31-nodejs-shutter"
      + record              = (known after apply)
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.static_webapp.azurerm_dns_cname_record.cname_record["labs-goldenpath-lukasz"] will be destroyed
  # (because key ["labs-goldenpath-lukasz"] is not in for_each map)
  - resource "azurerm_dns_cname_record" "cname_record" {
      - fqdn                = "labs-goldenpath-lukasz-shutter.sandbox.platform.hmcts.net." -> null
      - id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/sandbox.platform.hmcts.net/CNAME/labs-goldenpath-lukasz-shutter" -> null
      - name                = "labs-goldenpath-lukasz-shutter" -> null
      - record              = "salmon-stone-07cfcc703.4.azurestaticapps.net" -> null
      - resource_group_name = "reformMgmtRG" -> null
      - tags                = {} -> null
      - ttl                 = 300 -> null
      - zone_name           = "sandbox.platform.hmcts.net" -> null
        # (1 unchanged attribute hidden)
    }

  # module.static_webapp.azurerm_dns_cname_record.cname_record["labs-jamiemcconnell-nodejs"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "labs-jamiemcconnell-nodejs-shutter"
      + record              = (known after apply)
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.static_webapp.azurerm_dns_cname_record.cname_record["labs-lukaszk-hmcts-nodejs"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "labs-lukaszk-hmcts-nodejs-shutter"
      + record              = (known after apply)
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.static_webapp.azurerm_dns_txt_record.zone_validate["labs-ashleigh31-nodejs"] will be created
  + resource "azurerm_dns_txt_record" "zone_validate" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.labs-ashleigh31-nodejs"
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 3600
      + zone_name           = "sandbox.platform.hmcts.net"

      + record {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.static_webapp.azurerm_dns_txt_record.zone_validate["labs-dawidstrozak-nodejs"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "zone_validate" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/sandbox.platform.hmcts.net/TXT/_dnsauth.labs-dawidstrozak-nodejs"
        name                = "_dnsauth.labs-dawidstrozak-nodejs"
        tags                = {}
        # (4 unchanged attributes hidden)

      - record {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + record {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.static_webapp.azurerm_dns_txt_record.zone_validate["labs-goldenpath-ashleigh"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "zone_validate" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/sandbox.platform.hmcts.net/TXT/_dnsauth.labs-goldenpath-ashleigh"
        name                = "_dnsauth.labs-goldenpath-ashleigh"
        tags                = {}
        # (4 unchanged attributes hidden)

      - record {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + record {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.static_webapp.azurerm_dns_txt_record.zone_validate["labs-goldenpath-dawid"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "zone_validate" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/sandbox.platform.hmcts.net/TXT/_dnsauth.labs-goldenpath-dawid"
        name                = "_dnsauth.labs-goldenpath-dawid"
        tags                = {}
        # (4 unchanged attributes hidden)

      - record {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + record {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.static_webapp.azurerm_dns_txt_record.zone_validate["labs-goldenpath-jamie"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "zone_validate" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/sandbox.platform.hmcts.net/TXT/_dnsauth.labs-goldenpath-jamie"
        name                = "_dnsauth.labs-goldenpath-jamie"
        tags                = {}
        # (4 unchanged attributes hidden)

      - record {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + record {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.static_webapp.azurerm_dns_txt_record.zone_validate["labs-goldenpath-lukasz"] will be destroyed
  # (because key ["labs-goldenpath-lukasz"] is not in for_each map)
  - resource "azurerm_dns_txt_record" "zone_validate" {
      - fqdn                = "_dnsauth.labs-goldenpath-lukasz.sandbox.platform.hmcts.net." -> null
      - id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/sandbox.platform.hmcts.net/TXT/_dnsauth.labs-goldenpath-lukasz" -> null
      - name                = "_dnsauth.labs-goldenpath-lukasz" -> null
      - resource_group_name = "reformMgmtRG" -> null
      - tags                = {} -> null
      - ttl                 = 3600 -> null
      - zone_name           = "sandbox.platform.hmcts.net" -> null

      - record {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.static_webapp.azurerm_dns_txt_record.zone_validate["labs-jamiemcconnell-nodejs"] will be created
  + resource "azurerm_dns_txt_record" "zone_validate" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.labs-jamiemcconnell-nodejs"
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 3600
      + zone_name           = "sandbox.platform.hmcts.net"

      + record {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.static_webapp.azurerm_dns_txt_record.zone_validate["labs-lukaszk-hmcts-nodejs"] will be created
  + resource "azurerm_dns_txt_record" "zone_validate" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.labs-lukaszk-hmcts-nodejs"
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 3600
      + zone_name           = "sandbox.platform.hmcts.net"

      + record {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.static_webapp.azurerm_static_site.swebapp["labs-ashleigh31-nodejs"] will be created
  + resource "azurerm_static_site" "swebapp" {
      + api_key             = (sensitive value)
      + default_host_name   = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "labs-ashleigh31-nodejs"
      + resource_group_name = "cft-platform-shutter-webapp-sbox-rg"
      + sku_size            = "Free"
      + sku_tier            = "Free"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }
    }

  # module.static_webapp.azurerm_static_site.swebapp["labs-goldenpath-lukasz"] will be destroyed
  # (because key ["labs-goldenpath-lukasz"] is not in for_each map)
  - resource "azurerm_static_site" "swebapp" {
      - api_key             = (sensitive value) -> null
      - default_host_name   = "salmon-stone-07cfcc703.4.azurestaticapps.net" -> null
      - id                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-platform-shutter-webapp-sbox-rg/providers/Microsoft.Web/staticSites/labs-goldenpath-lukasz" -> null
      - location            = "westeurope" -> null
      - name                = "labs-goldenpath-lukasz" -> null
      - resource_group_name = "cft-platform-shutter-webapp-sbox-rg" -> null
      - sku_size            = "Free" -> null
      - sku_tier            = "Free" -> null
      - tags                = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/azure-platform-terraform"
          - "businessArea" = "CFT"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
          - "startupMode"  = "always"
        } -> null
    }

  # module.static_webapp.azurerm_static_site.swebapp["labs-jamiemcconnell-nodejs"] will be created
  + resource "azurerm_static_site" "swebapp" {
      + api_key             = (sensitive value)
      + default_host_name   = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "labs-jamiemcconnell-nodejs"
      + resource_group_name = "cft-platform-shutter-webapp-sbox-rg"
      + sku_size            = "Free"
      + sku_tier            = "Free"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }
    }

  # module.static_webapp.azurerm_static_site.swebapp["labs-lukaszk-hmcts-nodejs"] will be created
  + resource "azurerm_static_site" "swebapp" {
      + api_key             = (sensitive value)
      + default_host_name   = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "labs-lukaszk-hmcts-nodejs"
      + resource_group_name = "cft-platform-shutter-webapp-sbox-rg"
      + sku_size            = "Free"
      + sku_tier            = "Free"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }
    }

  # module.static_webapp.azurerm_static_site_custom_domain.custom_domain["labs-ashleigh31-nodejs"] will be created
  + resource "azurerm_static_site_custom_domain" "custom_domain" {
      + domain_name      = "labs-ashleigh31-nodejs.sandbox.platform.hmcts.net"
      + id               = (known after apply)
      + static_site_id   = (known after apply)
      + validation_token = (sensitive value)
      + validation_type  = "dns-txt-token"
    }

  # module.static_webapp.azurerm_static_site_custom_domain.custom_domain["labs-goldenpath-lukasz"] will be destroyed
  # (because key ["labs-goldenpath-lukasz"] is not in for_each map)
  - resource "azurerm_static_site_custom_domain" "custom_domain" {
      - domain_name      = "labs-goldenpath-lukasz.sandbox.platform.hmcts.net" -> null
      - id               = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-platform-shutter-webapp-sbox-rg/providers/Microsoft.Web/staticSites/labs-goldenpath-lukasz/customDomains/labs-goldenpath-lukasz.sandbox.platform.hmcts.net" -> null
      - static_site_id   = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-platform-shutter-webapp-sbox-rg/providers/Microsoft.Web/staticSites/labs-goldenpath-lukasz" -> null
      - validation_type  = "dns-txt-token" -> null
        # (1 unchanged attribute hidden)
    }

  # module.static_webapp.azurerm_static_site_custom_domain.custom_domain["labs-jamiemcconnell-nodejs"] will be created
  + resource "azurerm_static_site_custom_domain" "custom_domain" {
      + domain_name      = "labs-jamiemcconnell-nodejs.sandbox.platform.hmcts.net"
      + id               = (known after apply)
      + static_site_id   = (known after apply)
      + validation_token = (sensitive value)
      + validation_type  = "dns-txt-token"
    }

  # module.static_webapp.azurerm_static_site_custom_domain.custom_domain["labs-lukaszk-hmcts-nodejs"] will be created
  + resource "azurerm_static_site_custom_domain" "custom_domain" {
      + domain_name      = "labs-lukaszk-hmcts-nodejs.sandbox.platform.hmcts.net"
      + id               = (known after apply)
      + static_site_id   = (known after apply)
      + validation_token = (sensitive value)
      + validation_type  = "dns-txt-token"
    }

  # module.static_webapp.github_actions_secret.secret["labs-ashleigh31-nodejs"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "labs_ashleigh31_nodejs_sbox"
      + updated_at      = (known after apply)
    }

  # module.static_webapp.github_actions_secret.secret["labs-goldenpath-lukasz"] will be destroyed
  # (because key ["labs-goldenpath-lukasz"] is not in for_each map)
  - resource "github_actions_secret" "secret" {
      - created_at      = "2024-12-17 11:19:01 +0000 UTC" -> null
      - id              = "azure-shutter-pages:labs_goldenpath_lukasz_sbox" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "azure-shutter-pages" -> null
      - secret_name     = "labs_goldenpath_lukasz_sbox" -> null
      - updated_at      = "2024-12-17 11:19:01 +0000 UTC" -> null
        # (1 unchanged attribute hidden)
    }

  # module.static_webapp.github_actions_secret.secret["labs-jamiemcconnell-nodejs"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "labs_jamiemcconnell_nodejs_sbox"
      + updated_at      = (known after apply)
    }

  # module.static_webapp.github_actions_secret.secret["labs-lukaszk-hmcts-nodejs"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "labs_lukaszk_hmcts_nodejs_sbox"
      + updated_at      = (known after apply)
    }

Plan: 15 to add, 4 to change, 5 to destroy.

Changes to Outputs:
  ~ debug_shutter = [
        # (2 unchanged elements hidden)
        {
            backend_domain   = [
                "firewall-sbox-int-palo-labs-goldenpath-ashleigh.uksouth.cloudapp.azure.com",
            ]
            certificate_name = "wildcard-sandbox-platform-hmcts-net"
            custom_domain    = "labs-goldenpath-ashleigh.sandbox.platform.hmcts.net"
            disabled_rules   = {}
            dns_zone_name    = "sandbox.platform.hmcts.net"
            name             = "labs-goldenpath-ashleigh"
            product          = "labs-goldenpath-ashleigh"
        },
      - {
          - backend_domain   = [
              - "firewall-sbox-int-palo-labs-goldenpath-lukasz.uksouth.cloudapp.azure.com",
            ]
          - certificate_name = "wildcard-sandbox-platform-hmcts-net"
          - custom_domain    = "labs-goldenpath-lukasz.sandbox.platform.hmcts.net"
          - disabled_rules   = {}
          - dns_zone_name    = "sandbox.platform.hmcts.net"
          - name             = "labs-goldenpath-lukasz"
          - product          = "labs-goldenpath-lukasz"
        },
        {
            backend_domain   = [
                "firewall-sbox-int-palo-labs-goldenpath-jamie.uksouth.cloudapp.azure.com",
            ]
            certificate_name = "wildcard-sandbox-platform-hmcts-net"
            custom_domain    = "labs-goldenpath-jamie.sandbox.platform.hmcts.net"
            disabled_rules   = {}
            dns_zone_name    = "sandbox.platform.hmcts.net"
            name             = "labs-goldenpath-jamie"
            product          = "labs-goldenpath-jamie"
        },
        # (5 unchanged elements hidden)
    ]
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":2354,"Program":"tfcmt","SHA1":"","Target":"sbox_shutter_webapp - TerraformPlanApply","Vars":{}} -->